# DetectedCycleInDisplacedElementParents Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DisplacementElementFailures..::..DetectedCycleInDisplacedElementParents Property
BuiltInFailures..::..DisplacementElementFailures Class See Also
---
Invalid parent relationship for a Displacement element. No cycles are allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DetectedCycleInDisplacedElementParents { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DetectedCycleInDisplacedElementParents As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DetectedCycleInDisplacedElementParents {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DisplacementElementFailures Class
Autodesk.Revit.DB Namespace